{"format": "graph-model", "generatedBy": "2.6.0", "convertedBy": "TensorFlow.js Converter v3.8.0", "signature": {"inputs": {"input_1:0": {"name": "input_1:0", "dtype": "DT_STRING", "tensorShape": {"dim": [{"size": "-1"}]}}, "input_2:0": {"name": "input_2:0", "dtype": "DT_STRING", "tensorShape": {"dim": [{"size": "-1"}]}}}, "outputs": {"output_1": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "1"}]}}}}, "modelTopology": {"node": [{"name": "unknown", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1556406"}, {"size": "32"}]}}}}}, {"name": "StatefulPartitionedCall/ranking_model/sequential/embedding/embedding_lookup/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT64", "tensorShape": {}}}, "dtype": {"type": "DT_INT64"}}}, {"name": "unknown_0", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "25026"}, {"size": "32"}]}}}}}, {"name": "StatefulPartitionedCall/ranking_model/sequential_1/embedding_1/embedding_lookup/axis", "op": "Const", "attr": {"dtype": {"type": "DT_INT64"}, "value": {"tensor": {"dtype": "DT_INT64", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/ranking_model/concat/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/ranking_model/sequential_2/dense/MatMul/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/ranking_model/sequential_2/dense/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/ranking_model/sequential_2/dense_1/MatMul/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}, {"size": "32"}]}}}}}, {"name": "StatefulPartitionedCall/ranking_model/sequential_2/dense_1/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/ranking_model/sequential_2/dense_2/MatMul/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}, {"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/ranking_model/sequential_2/dense_2/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "input_1", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}]}}, "dtype": {"type": "DT_STRING"}}}, {"name": "input_2", "op": "Placeholder", "attr": {"dtype": {"type": "DT_STRING"}, "shape": {"shape": {"dim": [{"size": "-1"}]}}}}, {"name": "StatefulPartitionedCall/ranking_model/sequential/hashing/hash", "op": "StringToHashBucketFast", "input": ["input_1"], "attr": {"num_buckets": {"i": "1556406"}}}, {"name": "StatefulPartitionedCall/ranking_model/sequential_1/hashing_1/hash", "op": "StringToHashBucketFast", "input": ["input_2"], "attr": {"num_buckets": {"i": "25026"}}}, {"name": "StatefulPartitionedCall/ranking_model/sequential/embedding/embedding_lookup", "op": "GatherV2", "input": ["unknown", "StatefulPartitionedCall/ranking_model/sequential/hashing/hash", "StatefulPartitionedCall/ranking_model/sequential/embedding/embedding_lookup/axis"], "attr": {"Taxis": {"type": "DT_INT64"}, "Tindices": {"type": "DT_INT64"}, "Tparams": {"type": "DT_FLOAT"}, "batch_dims": {"i": "0"}}}, {"name": "StatefulPartitionedCall/ranking_model/sequential_1/embedding_1/embedding_lookup", "op": "GatherV2", "input": ["unknown_0", "StatefulPartitionedCall/ranking_model/sequential_1/hashing_1/hash", "StatefulPartitionedCall/ranking_model/sequential_1/embedding_1/embedding_lookup/axis"], "attr": {"Tindices": {"type": "DT_INT64"}, "Taxis": {"type": "DT_INT64"}, "batch_dims": {"i": "0"}, "Tparams": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/ranking_model/concat", "op": "ConcatV2", "input": ["StatefulPartitionedCall/ranking_model/sequential/embedding/embedding_lookup", "StatefulPartitionedCall/ranking_model/sequential_1/embedding_1/embedding_lookup", "StatefulPartitionedCall/ranking_model/concat/axis"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_FLOAT"}, "Tidx": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/ranking_model/sequential_2/dense/Relu", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/ranking_model/concat", "StatefulPartitionedCall/ranking_model/sequential_2/dense/MatMul/ReadVariableOp", "StatefulPartitionedCall/ranking_model/sequential_2/dense/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"T": {"type": "DT_FLOAT"}, "num_args": {"i": "1"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "transpose_b": {"b": false}, "epsilon": {"f": 0.0}, "transpose_a": {"b": false}}}, {"name": "StatefulPartitionedCall/ranking_model/sequential_2/dense_1/Relu", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/ranking_model/sequential_2/dense/Relu", "StatefulPartitionedCall/ranking_model/sequential_2/dense_1/MatMul/ReadVariableOp", "StatefulPartitionedCall/ranking_model/sequential_2/dense_1/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"epsilon": {"f": 0.0}, "num_args": {"i": "1"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "transpose_b": {"b": false}, "T": {"type": "DT_FLOAT"}, "transpose_a": {"b": false}}}, {"name": "StatefulPartitionedCall/ranking_model/sequential_2/dense_2/BiasAdd", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/ranking_model/sequential_2/dense_1/Relu", "StatefulPartitionedCall/ranking_model/sequential_2/dense_2/MatMul/ReadVariableOp", "StatefulPartitionedCall/ranking_model/sequential_2/dense_2/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "transpose_b": {"b": false}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "num_args": {"i": "1"}, "T": {"type": "DT_FLOAT"}, "epsilon": {"f": 0.0}}}, {"name": "Identity", "op": "Identity", "input": ["StatefulPartitionedCall/ranking_model/sequential_2/dense_2/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}], "library": {}, "versions": {"producer": 808}}, "weightsManifest": [{"paths": ["group1-shard1of49.bin", "group1-shard2of49.bin", "group1-shard3of49.bin", "group1-shard4of49.bin", "group1-shard5of49.bin", "group1-shard6of49.bin", "group1-shard7of49.bin", "group1-shard8of49.bin", "group1-shard9of49.bin", "group1-shard10of49.bin", "group1-shard11of49.bin", "group1-shard12of49.bin", "group1-shard13of49.bin", "group1-shard14of49.bin", "group1-shard15of49.bin", "group1-shard16of49.bin", "group1-shard17of49.bin", "group1-shard18of49.bin", "group1-shard19of49.bin", "group1-shard20of49.bin", "group1-shard21of49.bin", "group1-shard22of49.bin", "group1-shard23of49.bin", "group1-shard24of49.bin", "group1-shard25of49.bin", "group1-shard26of49.bin", "group1-shard27of49.bin", "group1-shard28of49.bin", "group1-shard29of49.bin", "group1-shard30of49.bin", "group1-shard31of49.bin", "group1-shard32of49.bin", "group1-shard33of49.bin", "group1-shard34of49.bin", "group1-shard35of49.bin", "group1-shard36of49.bin", "group1-shard37of49.bin", "group1-shard38of49.bin", "group1-shard39of49.bin", "group1-shard40of49.bin", "group1-shard41of49.bin", "group1-shard42of49.bin", "group1-shard43of49.bin", "group1-shard44of49.bin", "group1-shard45of49.bin", "group1-shard46of49.bin", "group1-shard47of49.bin", "group1-shard48of49.bin", "group1-shard49of49.bin"], "weights": [{"name": "unknown", "shape": [1556406, 32], "dtype": "float32"}, {"name": "StatefulPartitionedCall/ranking_model/sequential/embedding/embedding_lookup/axis", "shape": [], "dtype": "int32"}, {"name": "unknown_0", "shape": [25026, 32], "dtype": "float32"}, {"name": "StatefulPartitionedCall/ranking_model/sequential_1/embedding_1/embedding_lookup/axis", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/ranking_model/concat/axis", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/ranking_model/sequential_2/dense/MatMul/ReadVariableOp", "shape": [64, 64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/ranking_model/sequential_2/dense/BiasAdd/ReadVariableOp", "shape": [64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/ranking_model/sequential_2/dense_1/MatMul/ReadVariableOp", "shape": [64, 32], "dtype": "float32"}, {"name": "StatefulPartitionedCall/ranking_model/sequential_2/dense_1/BiasAdd/ReadVariableOp", "shape": [32], "dtype": "float32"}, {"name": "StatefulPartitionedCall/ranking_model/sequential_2/dense_2/MatMul/ReadVariableOp", "shape": [32, 1], "dtype": "float32"}, {"name": "StatefulPartitionedCall/ranking_model/sequential_2/dense_2/BiasAdd/ReadVariableOp", "shape": [1], "dtype": "float32"}]}]}